tests/western_union/endpoints/push_notification.xml

<NS1:Envelope xmlns:NS1="http://schemas.xmlsoap.org/soap/envelope/">
   <NS1:Header>
      <EndPoint>https://10.3.64.145:443/western_union/notification.svc</EndPoint>
      <nrt_retry_count>0</nrt_retry_count>
      <nrt_attempt_count>0</nrt_attempt_count>
      <agent_account>CUS000149</agent_account>
      <Net_Id>US125</Net_Id>
      <emailFlag>N</emailFlag>
      <partnerEmail>N</partnerEmail>
      <JSONpartner>N</JSONpartner>
   </NS1:Header>
   <NS1:Body>
      <NS2:nis-notification-request xmlns:NS2="http://www.westernunion.com/schema/xrsi">
         <partner>
            <id>WGQCUS1250T</id>
            <system>
               <id>WGQCUS1250T</id>
               <name>UNICEF</name>
               <version>9101</version>
               <ip_address>10.3.64.145</ip_address>
               <connector>
                  <id>US125QCUSD1A</id>
               </connector>
            </system>
         </partner>
         <sender>
            <name>
               <first_name>KATHY</first_name>
               <last_name>STONE</last_name>
            </name>
            <address>
               <addr_line1>################</addr_line1>
               <city>WITTER</city>
               <state>AR</state>
               <postal_code>72776</postal_code>
               <country_iso_code>USA</country_iso_code>
            </address>
            <contact_phone>##########</contact_phone>
            <bank_account>
               <name>##########################</name>
               <account_number>#######</account_number>
               <routing_number>#########</routing_number>
            </bank_account>
         </sender>
         <receiver>
            <name>
               <first_name>BENJAMIN</first_name>
               <last_name>ANDREWS</last_name>
            </name>
            <address>
               <state>TX</state>
               <postal_code>77328</postal_code>
               <country_iso_code>USA</country_iso_code>
            </address>
            <mobile_phone>
               <phone_number>331231312321</phone_number>
            </mobile_phone>
         </receiver>
         <payment_details>
            <origination>
               <principal_amount>8500</principal_amount>
               <currency_iso_code>USD</currency_iso_code>
               <country_iso_code>USA</country_iso_code>
            </origination>
            <destination>
               <expected_payout_amount>8500</expected_payout_amount>
               <currency_iso_code>USD</currency_iso_code>
               <country_iso_code>USA</country_iso_code>
            </destination>
         </payment_details>
         <transaction_id>2323589126420060</transaction_id>
         <money_transfer_control>
            <date>2023-08-23</date>
            <mtcn>3634673433</mtcn>
         </money_transfer_control>
         <notification_type>BIS003</notification_type>
         <message_code>DVQRFB51</message_code>
         <message_text>Receiver Paid Notification</message_text>
      </NS2:nis-notification-request>
   </NS1:Body>
</NS1:Envelope>